function sum(a) {
  return a + 10;
}
console.log(sum(10));
 // მოკლედ რომ ავხსნათ რეტურნის მერე არ შესრულდება არცერთი მაგალითი 
 // ხოლო პარამეტრი ა არის 10 და 10 მიუმატა 10 
 // შემოკლებით ჩაიწერება აასე..

 const sumn =a =>{
  return a+ 15;
 }
 console.log(sumn(10));
  //ესეც შემოკლებული ვერსია 

  // მაგრამ ეს უფრო შემოკლებულია

  const sumnn= a => a + 20;
  console.log(sumnn(10));
// ერთ ხაზზე მოცემული კოდია ეს 




const code =()=> 10+50;
console.log(code());

// გამოიტანს 60 

const codee =(a,b )=> a+b;
console.log(codee(10, 15));

//აქ გვქონდა პარამეტრები ა და ბი და ჩვენ მას გადავეცით 10 და 15 რომელის
// ჯამისც გამოთვალა და არის 25

