const cars = [`Ferary`, `porshe`,`subaru`,`opel`];


// let i= 0;
//  while (i < 6) {
//   console.log(`hello world`);
//   i++;
//  }
// ამ დროს გამოიტანს ოთხჯერ რადგან   ორს გამოვაკლოთ ექვსი არის ოთხი  ანუ ნულიდან რომ დაგვეწყო დაბეჭდავდა 
//ექვსჯერ
// ინდექსი იწყება ნულიდან
// for ციკლი უფრო მოსახერხებელია ზოგადად


// do გამოყენებით
// let i= 20;
// do{
// console.log(`hello`);

// }
// while(i<10); 

// აქ ერთხელ მაინც დაიბეჭდება არასწორი კოდის გამოც 
// არააქ მნიშველობა სწორი არის თუ არა 
let i=0;

// while (i < cars.length) {
//   console.log(`მანქნები : ${cars[i]}`);
//   i++;
// }
 
// მოკლედ ორჯერ ჩაიხვია 
// რადგან არ დავამატე i++; ამიტომ იყავით ყურადღებით 
// აქ გამოიტანს ყველა მანქანას  


while (i < cars.length) {
  console.log(`მე მყავს მანქნები : ${cars}`);
  i++;
}


